package Day1223;

// 자료구조 Set
// 집합을 표현한 자료 구조
// 데이터의 순서 개념이 없으며, 중복 값은 허용하지 않습니다.
// 사용자가 쓸 데이터의 중복 값을 걸러내는 용도로 사용

// 자바에서 제공해주는 Set은 인터페이스
// 인터페이스는 클래스와 클래스 사이의 중간 다리 역할
// 자바에서는 Set 인터페이스를 통해 구련한 다음과 같은 Set 클래스를 통해 자료구조 Set을 사용할 수 있다.

// 1. HashSet : 있는지 없는지 
// 2. TreeSet : 기준에 따라서 
// 3. LinkedHashSet : 순서

// Set 자료구조가 사용되는 예시
// 1. 집합에 관련된 문제를 해결할 때 
// 2. 중복 처리 작업을 고려해야 할 때
// 3. 데이터를 빠르게 조사할 때


public class SetExample {

	public static void main(String[] args) {
		// 기본 자료 구조 유형
		// 1. 스택, 큐
		// 2. 트리
		// 3. 맵
		// 4. 그래프
		// 5. 세트
		// 6. 딕셔너리

		
	}

}
